app/controllers/bukets_controller.rb

SELECT "bukets".* FROM "bukets"
---
  def index
    @bukets = Buket.all

INSERT INTO "bukets" ("title", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Букет #1"], ["description", "Хороший"], ["price", #<BigDecimal:7fa5a92fdce8,'-0.1E3',9(18)>], ["created_at", 2017-05-05 17:00:08 UTC], ["updated_at", 2017-05-05 17:00:08 UTC]]
---
  def create
    @buket = Buket.new(buket_params)

    respond_to do |format|
      if @buket.save

SELECT  "bukets".* FROM "bukets" WHERE "bukets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_buket
      @buket = Buket.find(params[:id])