app/controllers/flowers_controller.rb

  def index
    @flowers = Flower.all
---
SELECT "flowers".* FROM "flowers"

  def create
    @flower = Flower.new flower_params
    if @flower.save
---
INSERT INTO "flowers" ("name", "shelf_life", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Camomile"], ["shelf_life", 2017-06-02 16:07:09 UTC], ["created_at", 2017-05-29 16:07:09 UTC], ["updated_at", 2017-05-29 16:07:09 UTC]]

  def find_flower
    @flower = Flower.find(params[:id])
---
SELECT  "flowers".* FROM "flowers" WHERE "flowers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]